Revit 2027 API
IFCUserDefinedProperty.PropertyType Property
 The type of the property.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCUserDefinedPropertyType PropertyType { get; set; }
Public Property PropertyType As IFCUserDefinedPropertyType
	Get
	Set
public:
property IFCUserDefinedPropertyType PropertyType {
	IFCUserDefinedPropertyType get ();
	void set (IFCUserDefinedPropertyType value);
}
member PropertyType : IFCUserDefinedPropertyType with get, set
Property Value
IFCUserDefinedPropertyType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCUserDefinedProperty Class
Autodesk.Revit.DB Namespace